nf/NF_V3/NF_V3/interfaces/lixos/dcte-evento-20191009171016.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:cter="http://www.portalfiscal.inf.br/cte/wsdl/CteRecepcaoEvento"><soap:Header><cter:cteCabecMsg xmlns="http://www.portalfiscal.inf.br/cte"><cter:versaoDados>3.00</cter:versaoDados><cter:cUF>35</cter:cUF></cter:cteCabecMsg></soap:Header><soap:Body><cter:cteDadosMsg><eventoCTe xmlns="http://www.portalfiscal.inf.br/cte" versao="3.00"><infEvento Id="ID6101103519108260404200079157001000252767145304057701"><cOrgao>35</cOrgao><tpAmb>2</tpAmb><CNPJ>82604042000791</CNPJ><chCTe>35191082604042000791570010002527671453040577</chCTe><dhEvento>2019-10-09T22:16:00-00:00</dhEvento><tpEvento>610110</tpEvento><nSeqEvento>1</nSeqEvento><detEvento versaoEvento="3.00"><evPrestDesacordo><descEvento>Prestacao do Servico em Desacordo</descEvento><indDesacordoOper>1</indDesacordoOper><xObs>CT-e emitido com dados incorretos</xObs></evPrestDesacordo></detEvento></infEvento></eventoCTe></cter:cteDadosMsg></soap:Body></soap:Envelope>